import React, { useState } from 'react';
import Modal from 'react-modal';
import styles from './App.module.css';

import evstig from './images/evstig.jpg';
import goat from './images/goat.jpg';
import gorod from './images/gorod.jpg';
import pocht from './images/pocht.jpg';
import polovoy from './images/polovoy.jpg';
import reader from './images/reader.jpg';
import seller from './images/seller.jpg';
import skripach from './images/skripach.jpg';
import traktir from './images/traktir.jpg';

import Header from './Header'; // Импортируем компонент Header

function MyApp() {
  const [modalIsOpen, setModalIsOpen] = useState(false);
  const [modalImage, setModalImage] = useState('');
  const [modalDescription, setModalDescription] = useState('');
  const [modalLink, setModalLink] = useState(''); // Добавляем состояние для ссылки
  const [showContent, setShowContent] = useState(false);

  // Остальной ваш код
  const customStyles = {
    overlay: {
      backgroundColor: 'rgba(0, 0, 0, 0.5)'
    },
    content: {
      top: '50%',
      left: '50%',
      right: 'auto',
      bottom: 'auto',
      marginRight: '-50%',
      transform: 'translate(-50%, -50%)',
      border: 'none',
      background: '#222',
      overflow: 'auto',
      borderRadius: '8px',
      outline: 'none',
      color: '#fff'
    }
  };

  const openModal = (image, description, link) => {
    setModalImage(image);
    setModalDescription(description);
    setModalLink(link); // Устанавливаем переданную ссылку
    setModalIsOpen(true);
    setShowContent(false);
    setTimeout(() => {
      setShowContent(true);
    }, 300);
  };

  return (
    <>
      <Header />
      <div className={styles.App}>
        <button onClick={() => openModal(evstig, 'На Большой Покровской улице в Нижнем Новгороде на самой обычной лавочке скромно сидит неприметный человек, как будто только что вышедший из Нижегородского драматического театра и присевший на скамейку отдохнуть. Тем не менее, имя этого человека известно всем в нашей стране - это памятник великому актеру Евгению Александровичу Евстигнееву. Как это часто бывает, и место, и время установки памятника не случайны. Он был торжественно открыт в сентябре 2006 года ко дню 80-летия артиста, в городе, где он родился, окончил театральное училище (расположенное неподалеку и носящее сейчас его имя, - то самое, на фасаде которого расположились "коты, охотящиеся на голубей") и начал сценическую карьеру. Автор памятника - скульптор Владимир Полянский. Многие говорят, что никакой это не памятник, а просто городская скульптура. Терминологию я оспаривать не буду. Да, у него нет высокого гранитного постамента, он никуда не указывает рукой, не поражает гигантскими размерами. Но спросите любого прохожего: что ему больше по душе - такая вот скромная "скульптура" или многие другие памятники, во множестве стоящие в наших городах? Судя по чуть ли не протертому до дыр носу бронзового Евстигнеева - ответ очевиден.', 'http://nlp-api.ru:3000/evstig')} className={styles.button}> 
          <img src={evstig} alt="Изображение 1" className={styles['thumbnail']} />
          <span className={styles.tooltip}>Нажмите, чтобы увидеть больше</span> {/* Текстовая подсказка */}
        </button>
        <button onClick={() => openModal(goat, 'Памятник Козе-Дерезе (другое название - "веселая коза") появился на Большой Покровской в 2005 году, в то же время, что и другие скульптуры, изображающих жителей Нижнего Новгорода конца XIX века. Располагается это смешное и забавное изваяние на Театральной плащади, и отнюдь не случайно - именно здесь с 1993 года проводится ежегодный всероссийский фестиваль, эмблемой которого и является "веселая коза". Это может показаться случайным и забавным совпадением, но автор "козы" - скульптор Сидоров. Поэтому ее по праву можно считать "Сидоровой козой". Существует легенда, согласно которой история этого веселого животного начинается еще в XVIII веке. В то время Екатерина II затеяла ревизию гербов всех городов России, и тогда символом Нижнего Новгорода стал красный олень на фоне белого геральдического щита. В свою очередь, губернская власть решила создать свой герб (причем с сохранением самого оленя), дабы отделиться от городской. Но нижегородские художники подошли к делу настолько "творчески", что частенько его изображения весьма отдаленно походили на благородного зверя, а скорее смахивали на танцующую козу. Это неизменно вызывало улыбку у местных жителей и в результате всех этих многочисленных оленей окрестили "веселой козой". Но кроме этой "исторической" версии существует другая - более "героическая". Еще раньше, в XVII веке в городе случился сильный пожар - ночью загорелись дворовые постройки. Огонь настолько напугал спавшую в хлеву козу, что та в панике вырвалась из сарая, поскакала по улице, наткнулась на пожарный столб и подняла набат, запутавшись рогами в веревке от колокола. От звона горожане проснулись и потушили пламя. С тех пор во время масленичных гуляний в Нижнем Новгороде появилась традиция славить козу.', 'http://nlp-api.ru:3000/goat')} className={styles.button}>
          <img src={goat} alt="Изображение 2" className={styles['thumbnail']} />
          <span className={styles.tooltip}>Нажмите, чтобы увидеть больше</span> {/* Текстовая подсказка */}
        </button>
        <button onClick={() => openModal(gorod, 'Памятник Городовому входит в серию скульптур, изображающих жителей Нижнего Новгорода конца XIX века. Изготовлен в Челябинске, установлен в самом начале Большой Покровской улицы в 2006 году ко Дню города, и олицетворяет полицейского, одетого по форме тех времен. Его автор - нижегородский скульптор Владимир Федорович Шиканов. Городовой — низший чин городской полиции в Российской империи после реформы 1862 года. Вооружались револьвером, шашкой и полицейским свистком. Набирались из отставных солдат и унтер-офицеров по вольному найму и содержались за счет городской казны. Имели особые наплечные знаки различия в виде контр-погонов (поперечные погоны) с лычками по званию, полученному на действительной военной службе, и наложенным сверху двойным оранжевым шнуром соответственно полицейскому званию. Летом городовые надевали светлую льняную гимнастерку без карманов или длинные двубортные белые кители. Зимой ходили в суконных гимнастерках или двубортных мундирах, а также носили черные длинношерстные папахи, башлыки, а иногда и полушубки. На головном уборе был городской герб со своим служебным номером. В городах с населением более 2000 человек, по закону 1887 года полагалось не более 1 городового на каждые 500 человек. На каждых четырех городовых приходился один старший. На содержание городовых выделялось: старшему - 180 рублей, младшим - 150 рублей в год. Обмундирование оплачивалось отдельно - на это выделялось 25 рублей ежегодно. Хоть городовой и являлся в те времена самым низким полицейским чином, но памятник ему подчеркивает его значимость - не зря же его поставили у самого начала Большой Покровской.', 'http://nlp-api.ru:3000/gorod')} className={styles.button}>
          <img src={gorod} alt="Изображение 3" className={styles['thumbnail']} />
          <span className={styles.tooltip}>Нажмите, чтобы увидеть больше</span> {/* Текстовая подсказка */}
        </button>
        <button onClick={() => openModal(pocht, 'Памятник Почтальону входит в серию скульптур, изображающих жителей Нижнего Новгорода конца XIX века. Установлен 10 сентября 2006 года и находится в самом конце пешеходной зоны по улице Большая Покровская. Автор композиции - нижегородский скульптор Владимир Федорович Шиканов. Местоположение памятника не случайно - он стоит в непосредственной близости от главного почтамта, где много лет назад находился ямской двор, являвшийся предшественником государственной почты. Каждый человек хоть раз видел почтальона (пусть даже только в старых кинофильмах). А вот как выглядел развозчик писем в конце XIX века - знают далеко не все. Это в наше время электронных писем и интернета почтальоны практически исчезли, а век назад без них было просто никак не обойтись. Ведь даже расстояния между городами тогда считали между главпочтамптами. Следует также сказать, что первый почтмейстер появился в Нижнем Новгороде более чем два века назад. Памятник изображает человека, одетого в свою особую униформу, с сумкой через плечо, в которой полным-полно корреспонденции. Он опирается на велосипед и выглядит так, будто остановился отдохнуть и скоро снова поедет развозить письма и газеты.', 'http://nlp-api.ru:3000/pocht')} className={styles.button}>
          <img src={pocht} alt="Изображение 3" className={styles['thumbnail']} />
          <span className={styles.tooltip}>Нажмите, чтобы увидеть больше</span> {/* Текстовая подсказка */}
        </button>
        <button onClick={() => openModal(polovoy, 'Памятник "Половому" входит в серию скульптур, изображающих жителей Нижнего Новгорода конца XIX века и был установлен на Большой Покровской улице в 2006 году. Автор композиции - нижегородский скульптор Владимир Федорович Шиканов. "Половыми" в России до начала ХХ века называли обслуживающий персонал в трактирах. Именно в трактирах, поскольку аналогичных людей в ресторанах (после их появления в России в XIX веке) называли "официантами". Назывались половые так потому, что одной из обязанностей трактирного слуги было содержание пола в чистоте. В отличие от официантов, одевавшихся "по европейской моде", половые обычно были одеты по-русски: заправленные в сапоги штаны (часто белые) и рубаха навыпуск, подпоясанная шнуром с кистями. Основной обязанностью полового в трактире (как и официантов в ресторанах) было обслуживание клиентов. Если при трактире была гостиница, то половые "в нагрузку" выполняли также функции портье. Интересно, что чаще всего они не получали жалованья от хозяина - единственным их видом заработка были чаевые. Значительную часть половых составляли подростки 13-16 лет. В конце 2009 года памятник сильно постарадал от вандалов (что, к сожалению, отнюдь не редкость для скульптур на Большой Покровской): его уронили, в результате чего корпус разбился на несколько частей. Реставраторы основательно потрудились, восстанавливая его. Чтобы избежать повторения ситуации, конструкцию укрепили специальными штырями. Администрация Нижегородского района потратила на ремонт более 40 тыс. рублей. В результате, после нескольких месяцев работы, "половой" в 2010 году вновь появился на Большой Покровской, но уже в другом месте - на пересечении улиц Большая Покровская и Лыковая дамба, у входа в ресторан "Виталич".', 'http://nlp-api.ru:3000/polovoy')} className={styles.button}>
          <img src={polovoy} alt="Изображение 3" className={styles['thumbnail']} />
          <span className={styles.tooltip}>Нажмите, чтобы увидеть больше</span> {/* Текстовая подсказка */}
        </button>
        <button onClick={() => openModal(reader, 'В самом центре Нижнего Новгорода в сквере на площади Минина и Пожарского стоит человек, держащий в руках трубку мобильного телефона. В ногах у него огромная стопка газет - как будто это курьер, разносящий газеты и остановившийся уточнить адрес по мобильнику. Автор памятника - петербургский скульптор Михаил Белов, он был установлен в 2013 году и стал вторым в триптихе, посвященном газете "Из рук в руки" - в 2008 году в том же скверике появился "Человек, читающий газету". А вот про третий памятник триптиха мне ничего не известно. Можно только предположить, что это "Памятник объявлению".', 'http://nlp-api.ru:3000/reader')} className={styles.button}>
          <img src={reader} alt="Изображение 3" className={styles['thumbnail']} />
          <span className={styles.tooltip}>Нажмите, чтобы увидеть больше</span> {/* Текстовая подсказка */}
        </button>
        <button onClick={() => openModal(seller, 'В центре Нижнего Новгорода, в сквере на площади Минина и Пожарского, на скамейке у фонтана расположился человек в длинном пальто и шляпе, увлеченно читающий газету. Газета эта - "Из рук в руки". Инициатором установки памятника читателю (его еще называют "вечным читателем") выступило ООО "Пронто-НН", издававшее газету бесплатных объявлений "Из рук в руки", и которое в 2008 году отмечало свое пятнадцатилетие. Инициатива была поддержана нижегородской администрацией, автором композиции является скульптор Михаил Белов. Этот памятник стал первым в триптихе, посвященном газете "Из рук в руки" - в 2013 году в том же скверике появился "Человек с мобильником". А вот про третий памятник мне ничего не известно. Может, это "Памятник объявлению"? Скульптуру очень полюбили местные студенты - на скамейке рядом с "Читателем" частенько сидят молодые люди с конспектами, сдающие летнюю сессию. А вот зимой "Читатель" сидит в одиночестве - присаживаться в мороз на металлическую скамью не очень комфортно.', 'http://nlp-api.ru:3000/seller')} className={styles.button}>
          <img src={seller} alt="Изображение 3" className={styles['thumbnail']} />
          <span className={styles.tooltip}>Нажмите, чтобы увидеть больше</span> {/* Текстовая подсказка */}
        </button>
        <button onClick={() => openModal(skripach, 'Театральная площадь - любимое место уличных музыкантов еще с 19 века. Вековая история Нижнего Новгорода помнит небольшого юношу, которые ежедневно оттачивал свое мастерство по периметру Театральной площади, он исполнял композиции Моцарта и Баха, и качество музыки было на высоком уровне. В 2006 году местные власти поставили бронзовою скульптуру маленького мальчика, который одет в простенький концертный костюм, а его голова усыпана тысячами завитушек. Памятник молодому скрипачу олицетворяет целеустремленность музыкантов и любовь к искусству.', 'http://nlp-api.ru:3000/skrip')} className={styles.button}>
          <img src={skripach} alt="Изображение 3" className={styles['thumbnail']} />
          <span className={styles.tooltip}>Нажмите, чтобы увидеть больше</span> {/* Текстовая подсказка */}
        </button>
        <button onClick={() => openModal(traktir, 'Представитель нижегородцев из прошлого. Услужливый мужчина с солидной бородой и хорошими манерами. Любопытно, что прообразом статуи пожилого улыбающегося господина с длинными волосами, гостеприимно протягивающего в сторону руку, что стоит возле детской площадки напротив магазина художественных промыслов, явился один из ныне живущих нижегородцев.', 'http://nlp-api.ru:3000/traktir')} className={styles.button}>
          <img src={traktir} alt="Изображение 3" className={styles['thumbnail']} />
          <span className={styles.tooltip}>Нажмите, чтобы увидеть больше</span> {/* Текстовая подсказка */}
        </button>

        <Modal
          isOpen={modalIsOpen}
          onRequestClose={() => setModalIsOpen(false)}
          style={customStyles}
        >
          <div className={styles['modal-content']}>
            {modalImage && <img src={modalImage} alt="Изображение" className={styles['modal-img']} />}
            <p className={styles['modal-text']}>
              {modalDescription}
            </p>
            <div className={styles['modal-button-group']}>
              <a href={modalLink} className={styles['modal-link']} style={{textDecoration: 'none'}}>
                Модель
              </a>
              <button onClick={() => setModalIsOpen(false)} className={styles['modal-close-btn']}>
                Закрыть
              </button>
            </div>
          </div>
        </Modal>

      </div>
    </>
  );
}

export default MyApp;
